/**
 * resultCode
 */
var resultCode = {
		/**********************通用错误码********************************************/
		"0": "成功",
		"1": "登录过期或未登录,请重新登录",
		"2": "未知错误",
		"3":"{1}",//提示由程序代码给出
		"10001": "参数错误",
		"10002": "保存失败",
	    
		/**********************用户模块************************************/
		"100001": "用户名或密码不正确",
	    "100002": "用户名已被使用",
	    "100003": "用户员工号已被使用",
	    "100004": "用户所属角色设置的设备展示权限不一致",
	    "100005": "不能删除系统用户",
	    "100006": "用户不存在",
	    "100007": "用户无组织机构",
	    "100008": "原始密码错误",
	    "100009": "用户关联的人员已被关联",
	    
	    
	    /*******************附件 ***********************/
	    "105001": "获取文件失败",
	    "105002": "上传文件时，出现异常",
	    "105003": "文件下载时，出现文件操作异常",
	    "105004": "文件下载时，出现未知异常",
	    "105005": "文件上传时，文件大小超出服务器限制",
	    "105006": "打开导入文件失败",
	    "105007": "不支持此类型文件导入",
	    "105008": "获取文件所属组织时失败",
	    "105009": "获取ftp配置时失败",
	    "105010": "获取附件信息失败",
	    "105011": "连接ftp服务器失败",
	    "105012": "附件名称超过允许长度",
	    
	    /*******************角色模块 ***********************/
	    "108001": "角色名不能为空",	
	    "108002": "角色名称已经存在",
	    "108003": "未找到该角色",
	    "108004": "角色等级不正确",
	    "108005": "添加角色时，平台组织未正确配置",
	    "108006": "{1}",//描述动态生成
};