/**
 * Created by Administrator on 2015/12/22.
 */

var STATICMSG = {
    "ok":"保存成功!",
    "fail":"保存失败!",
    "addOk":"添加成功！",
/** 
 * 客户模块
 */

/** 
 * 项目模块
 */
    2001:"确定删除用户?",
    2002:"删除用户成功!",
    2003:"确认删除？",

/** 
 * 简历模块
 */
    3001: "暂无人才！",
    3002: "您的账号获取次数已用完。请电话联系400-028-3459进行寻洽。",
    3003:"您的账户剩余{1}次获取联系方式的机会，继续获取将扣除1次，确定获取？",
    3004:"系统正在努力计算，请在10秒后刷新。",
    3005:"暂无人才！",
    3006:"点击不合适后该类人才将不会再推荐，确认不合适?",
    3007:"您的账号发布职位次数已用完。请电话联系400-028-3459进行寻洽。",
    3008:"{1}： {2}（人才来自寻英网）",
    3009:"以下是来自寻英网的人才推荐-{1}。我已查阅，请你评估。若觉合适，我将发送面试邀请。",
    3010:"您的账户剩余{1}次获取联系方式的机会，继续邀请面试将扣除1次，确定邀请？",
    3011:"请至少选择1份简历",
    3012:"操作成功！",
    3013:"备注不能为空！",
    3014:"确认删除？",
    3015:"推送成功！",
    3016:"<span style='color:red;'>确认清除全部未读简历？</span>",
    3017:"输入的数据有误",
    3018:"充值成功！",
    2019:"请选择不合适原因！",

    //draw2d
    4001:"请选中节点进行删除",
    4002:"应用模板将覆盖编辑区域已有组件，是否应用？",
    4003:"您当前为预览模板状态，请先选择应用或关闭预览",
    4004:"删除成功！",
    4005:"导出成功",
    4006:"请至少勾选一个节点导出简历！",
    4007:"确认退出编辑组件？"

    /*1001:"收藏成功",
    1002:"收藏失败",
    1003:"转发成功",
    1004:"转发失败",
    1005:"邀请面试成功",
    1006:"邀请面试失败",
    1007:"邮箱重复",
    1008:"备注成功",
    1009:"备注失败",
    1010:"取消收藏成功",
    1011:"取消收藏失败",
    1012:"备注成功",
    1013:"备注失败",
    1014:"确认取消收藏?",
    1015:"删除成功",
    1016:"删除失败",
    1017:"邮箱不符合规则",
    1018:"上传数量已达最大值",
    1019:"仅支持{1}为后缀名的文件!",
    1020:"确认淘汰?",
    1021:"淘汰成功",
    1022:"发布成功!",
    1023:"取消订阅成功！",
    1024:"订阅成功！",

    2001:"您的账号获取次数已用完。请电话联系400-028-3459进行寻洽。",
    2002:"您的账户剩余{1}次获取联系方式的机会，继续获取将扣除1次，确定获取？",
    2003:"系统正在努力计算，请在10秒后刷新。",
    2004:"暂无人才！",
    2005:"点击不合适后该类人才将不会再推荐，确认不合适?",
    2006:"您的账号发布职位次数已用完。请电话联系400-028-3459进行寻洽。",
    2007:"{1}： {2}（人才来自寻英网）",
    2008:"以下是来自寻英网的人才推荐-{1}。我已查阅，请你评估。若觉合适，我将发送面试邀请。",
    2009:"暂无职位!",
    2010:"邮箱超过长度",
    2011:"月薪必须为大于0的数字",
    2012:"最高薪资不能低于最低薪资",
    2013:"获取职位描述中，请稍候..",
    2014:"关键词已达上限",
    2015:"关键词重复",
    2016:"暂无动态！",
    2017:"您的位置无法定位",
    2018:"续费请拨打全国热线400-028-3459，专业招聘顾问在线服务。",
    2019:"您的账户剩余{1}次获取联系方式的机会，继续邀请面试将扣除1次，确定邀请？",
    2020:"密码修改成功，即将跳往登录页...",
    2021:"{1}职位日暂无最新简历推送，您可订阅该职位接收邮件通知。",
    2022:"职位订阅已开通，如有合适简历，我们将第一时间邮件通知。",
    2023:"删除提示后，该职位将无法订阅，确认删除？",
    2024:"取消职位订阅后，最新人才推荐将不再邮件通知，确定取消？",
    static:{
        pageCount:10
    },
    position:{
        1 :"确认上线？",
        2 :"确认下线？",
        3 : "当前职位有修改，是否保存？",
        4 : "上线成功！",
        5 : "下线成功！"
    },
    recuit_tab:{1:"待处理",2:" 待面试",3:" 已录取",4:" 已淘汰"},
    recuit_status:{1:"转发评审",2:"审核通过",3:"审核未通过",4:"邀请面试",5:"面试通过",6:"淘汰",7:"收藏"},
    recuit_operate:{1:"转发评审",2:"审核通过",3:"审核未通过",4:"待面试",5:"已录取",6:"已淘汰"}*/

};